<template>
    <div>
        <p style="margin-top:300px">Здесь должна быть оплата, но мне лень опять подключать киви п2п апи или фри касу, в прошлом проекте уже делал)</p><br>
        <p>Вообще тут много приколов, например что корзина не отображается для не  вошедших людей. Тк локал сторедж может хранить ток простые значения. Так что при нажатии кнопки добавления товара в корзину приходится в корзину кидать не сам объект продукта, а только его айдишник. И потом чтобы отобразить для него корзину это надо конвертировать эту строку в массив по спец символу(в моем случае это //). Потом получить с бд каждый товар, все товары закинуть в массив и только потом передать его. Ничего сложного, но лень</p>
    </div>
</template>
